import numpy as np

def rectangle_integration(func, a, b, n):
    """
    Функція для чисельного інтегрування методом прямокутників.

    :param func: Функція, яку потрібно інтегрувати.
    :param a: Нижня межа інтегрування.
    :param b: Верхня межа інтегрування.
    :param n: Кількість прямокутників, щоб розбити область інтегрування.
    :return: Значення наближеного інтегралу.
    """
    x = np.linspace(a, b, n+1)  # Генеруємо n рівномірно розподілених точок
    dx = (b - a) / n  # Ширина кожного прямокутника
    integral = np.sum(func(x[:-1]) * dx)  # Обчислюємо суму площ прямокутників
    return integral

# Приклад використання:
# pi=np.pi

# e=np.exp(1)
# f=2*((4/(1.2*np.sqrt(2*pi)))*e**((-1/2)*((x-11)/1.2)**2)+(7/(2.4*np.sqrt(2*pi)))*e**((-1/2)*((x-15)/2.4)**2))

def function(x):
    pi=np.pi
    # print("pi=",pi)
    e=np.exp(1)
    return 2*((4/(1.2*np.sqrt(2*pi)))*e**((-1/2)*((x-11)/1.2)**2)+(7/(2.4*np.sqrt(2*pi)))*e**((-1/2)*((x-15)/2.4)**2))  # Приклад функції, яку потрібно інтегрувати

a = 0  # Нижня межа інтегрування
b = 1  # Верхня межа інтегрування
n = 1000  # Кількість прямокутників

approx_integral = rectangle_integration(function, a, b, n)
print("Наближений інтеграл:", approx_integral)












